<img src = 'Data/books2.png'>

In [1]:
import os
os.makedirs('Data/', exist_ok=True)
os.listdir('Data/')

['favorites.csv',
 'authors.csv',
 'users.csv',
 'books.csv',
 'books2.png',
 '.ipynb_checkpoints']

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [3]:
import json
with open('/Users/justinfields/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [4]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/books_project"
engine = create_engine(connection)

In [5]:
books = pd.read_csv('data/books.csv')
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [6]:
users = pd.read_csv('data/users.csv')
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [7]:
authors = pd.read_csv('data/authors.csv')
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [8]:
favorites = pd.read_csv('data/favorites.csv')
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [9]:
books.to_sql('books', engine, if_exists = 'replace')

6

In [10]:
users.to_sql('users', engine, if_exists = 'replace')

3

In [11]:
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [12]:
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [13]:
q = '''SHOW TABLES'''
pd.read_sql(q,engine)

  Tables_in_books_project
0                 authors
1                   books
2               favorites
3                   users

In [22]:
q = """SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1